
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ПустаяСтрока(Объект.scheme) Тогда
		Попытка
			scheme = ОбщегоНазначенияSwagger.СформироватьОбъектаНаОснованииJSON(Объект.scheme);
		Исключение
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("В поле ""scheme"" должен быть валидный json");
		КонецПопытки;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Объект.flows) Тогда
		Попытка
			flows = ОбщегоНазначенияSwagger.СформироватьОбъектаНаОснованииJSON(Объект.flows);
		Исключение
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("В поле ""flows"" должен быть валидный json");
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

