
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьИДоступность()
	Если Объект.ИсточникСервиса = ПредопределенноеЗначение("Перечисление.ИсточникиСервиса.ВнешняяСсылка") Тогда
		Элементы.ГруппаОписание.ТекущаяСтраница = Элементы.ГруппаВнешнийUrl;
	ИначеЕсли Объект.ИсточникСервиса = ПредопределенноеЗначение("Перечисление.ИсточникиСервиса.ОбъектнаяСпецификация") Тогда
		Элементы.ГруппаОписание.ТекущаяСтраница = Элементы.ГруппаВнутреннееОписание;
	Иначе
		Элементы.ГруппаОписание.ТекущаяСтраница = Элементы.ГруппаТекстовоеОписание;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВнешнийРесурсПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
КонецПроцедуры
