
Функция СформироватьJsonSwagger() Экспорт 
	Описание = Новый Соответствие;
	
	Если ЗначениеЗаполнено(ЭтотОбъект._description) Тогда
		Описание.Вставить("description", ЭтотОбъект._description);
	КонецЕсли;
	
	Описание.Вставить("name", ЭтотОбъект.name);
	Описание.Вставить("in", ЭтотОбъект._in);
	
	Описание.Вставить("required", ЭтотОбъект.required);
	Описание.Вставить("deprecated", ЭтотОбъект.deprecated);
	Описание.Вставить("allowEmptyValue", ЭтотОбъект.allowEmptyValue);
	Описание.Вставить("explode", ЭтотОбъект.explode);
	Описание.Вставить("allowReserved", ЭтотОбъект.allowReserved);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.schema) Тогда
		Описание.Вставить("schema", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.schema));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.example) Тогда
		Описание.Вставить("example", ОбщегоНазначенияSwagger.СформироватьОбъектаНаОснованииJSON(ЭтотОбъект.example));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.style) Тогда
		Описание.Вставить("style", ЭтотОбъект.style);
	КонецЕсли;
	
	Если ЭтотОбъект.content.Количество() > 0 Тогда
		Описание.Вставить("content", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "content", "key", "mediaType"));
	КонецЕсли;
	
	Возврат КоннекторHTTP.ОбъектВJson(Описание);
КонецФункции
