
Функция СформироватьJsonSwagger() Экспорт 
	Описание = Новый Соответствие;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.schema) Тогда
		Описание.Вставить("schema", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.schema));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.example) Тогда
		Описание.Вставить("example", ОбщегоНазначенияSwagger.СформироватьОбъектаНаОснованииJSON(ЭтотОбъект.example));
	КонецЕсли;
	
	Если ЭтотОбъект.examples.Количество() > 0 Тогда
		Описание.Вставить("examples", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "examples", "key", "example"));
	КонецЕсли;
	
	Если ЭтотОбъект.encodings.Количество() > 0 Тогда
		Описание.Вставить("encoding", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "encodings", "key", "encoding"));
	КонецЕсли;
	
	Возврат КоннекторHTTP.ОбъектВJson(Описание);
КонецФункции
