
Функция СформироватьJsonSwagger() Экспорт 
	Описание = Новый Соответствие;
	Описание.Вставить("type", ЭтотОбъект.type);
	
	Если ЗначениеЗаполнено(ЭтотОбъект._description) Тогда
		Описание.Вставить("description", ЭтотОбъект._description);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.name) Тогда
		Описание.Вставить("name", ЭтотОбъект.name);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект._in) Тогда
		Описание.Вставить("in", ЭтотОбъект._in);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.scheme) Тогда
		Описание.Вставить("scheme", ОбщегоНазначенияSwagger.СформироватьОбъектаНаОснованииJSON(ЭтотОбъект.scheme));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.flows) Тогда
		Описание.Вставить("flows", ОбщегоНазначенияSwagger.СформироватьОбъектаНаОснованииJSON(ЭтотОбъект.flows));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.bearerFormat) Тогда
		Описание.Вставить("bearerFormat", ЭтотОбъект.bearerFormat);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.openIdConnectUrl) Тогда
		Описание.Вставить("openIdConnectUrl", ЭтотОбъект.openIdConnectUrl);
	КонецЕсли;
	
	Возврат КоннекторHTTP.ОбъектВJson(Описание);
КонецФункции
