
Функция СформироватьJsonSwagger() Экспорт 
	Описание = Новый Соответствие;
	
	Если ЗначениеЗаполнено(ЭтотОбъект._description) Тогда
		Описание.Вставить("description", ЭтотОбъект._description);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.operationRef) Тогда
		Описание.Вставить("operationRef", ЭтотОбъект.operationRef);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.operationId) Тогда
		Описание.Вставить("operationId", ЭтотОбъект.operationId);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.requestBody) Тогда
		Описание.Вставить("requestBody", КоннекторHTTP.JsonВОбъект(ЭтотОбъект.requestBody));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.server) Тогда
		Описание.Вставить("server", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.server));
	КонецЕсли;
	
	Если ЭтотОбъект.parameters.Количество() > 0 Тогда
		Соответствие = Новый Соответствие;
		Для каждого ТекСтрока Из ЭтотОбъект.parameters Цикл
			Соответствие.Вставить(ТекСтрока.key, КоннекторHTTP.JsonВОбъект(ТекСтрока.value));
		КонецЦикла;
		Описание.Вставить("parameters", Соответствие);
	КонецЕсли;
	
	Возврат КоннекторHTTP.ОбъектВJson(Описание);
КонецФункции
