
Функция СформироватьJsonSwagger() Экспорт 
	Описание = Новый Соответствие;
	Если ЗначениеЗаполнено(ЭтотОбъект._description) Тогда
		Описание.Вставить("description", ЭтотОбъект._description);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтотОбъект.summary) Тогда
		Описание.Вставить("summary", ЭтотОбъект.summary);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтотОбъект.externalValue) Тогда
		Описание.Вставить("externalValue", ЭтотОбъект.externalValue);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтотОбъект.value) Тогда
		Значение = ОбщегоНазначенияSwagger.СформироватьОбъектаНаОснованииJSON(ЭтотОбъект.value);
		Описание.Вставить("value", Значение);
	КонецЕсли;
	
	Возврат КоннекторHTTP.ОбъектВJson(Описание);
КонецФункции
