
&НаКлиенте
Процедура variablesenumНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.variables.ТекущиеДанные;
	МассивЗначений = СтрРазделить(ТекущаяСтрока.enum, ",", Ложь);
	ОО = Новый ОписаниеОповещения("ПослеРедактированияМассива", ЭтотОбъект, ТекущаяСтрока.ПолучитьИдентификатор());
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияМассивов", новый Структура("Массив", МассивЗначений), ЭтотОбъект,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактированияМассива(Результат, ИдентификаторСтроки) Экспорт 
	Если Результат <> Неопределено Тогда
		ТекущаяСтрока = Объект.variables.НайтиПоИдентификатору(ИдентификаторСтроки);
		Строка = "";
		Для каждого Элемент Из Результат Цикл
			Строка = Строка + Элемент + ",";
		КонецЦикла;
		
		Строка = Сред(Строка, 1, СтрДлина(Строка) - 1);
		
		ТекущаяСтрока.enum = Строка;
	КонецЕсли;
КонецПроцедуры
