
Функция СформироватьJsonSwagger() Экспорт 
	Описание = Новый Соответствие;
	
	Если ЗначениеЗаполнено(ЭтотОбъект._description) Тогда
		Описание.Вставить("description", ЭтотОбъект._description);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.summary) Тогда
		Описание.Вставить("summary", ЭтотОбъект.summary);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект._ref) Тогда
		Описание.Вставить("$ref", ЭтотОбъект._ref);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.get) Тогда
		Описание.Вставить("get", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.get));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.post) Тогда
		Описание.Вставить("post", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.post));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.put) Тогда
		Описание.Вставить("put", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.put));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.delete) Тогда
		Описание.Вставить("delete", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.delete));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.options) Тогда
		Описание.Вставить("options", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.options));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.patch) Тогда
		Описание.Вставить("patch", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.patch));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.head) Тогда
		Описание.Вставить("head", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.head));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.trace) Тогда
		Описание.Вставить("trace", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.trace));
	КонецЕсли;
	
	Если ЭтотОбъект.parameters.Количество() > 0 Тогда
		Описание.Вставить("parameters", ОбщегоНазначенияSwagger.СформироватьМассивИзТЧ(ЭтотОбъект, "parameters", "parameter"));
	КонецЕсли;
	
	Если ЭтотОбъект.servers.Количество() > 0 Тогда
		Описание.Вставить("servers", ОбщегоНазначенияSwagger.СформироватьМассивИзТЧ(ЭтотОбъект, "servers", "server"));
	КонецЕсли;
	
	Если ЭтотОбъект.tags.Количество() > 0 Тогда
		Массив = Новый Массив;
		Для каждого ТекСтрока Из ЭтотОбъект.tags Цикл
			Массив.Добавить(Строка(ТекСтрока.tag));
		КонецЦикла;
		Описание.Вставить("tags", Массив);
	КонецЕсли;
	
	Возврат КоннекторHTTP.ОбъектВJson(Описание);
КонецФункции
