
Функция НачальнаяСтраницаGet(Запрос)
	Возврат ОбработчикиHTTPЗапросов.НачальнаяСтраницаGet(Запрос);
КонецФункции

Функция APIPOST(Запрос)
	Возврат ОбработчикиHTTPЗапросов.APIPOST(Запрос);
КонецФункции

Функция APIGET(Запрос)
	Возврат ОбработчикиHTTPЗапросов.APIGET(Запрос);
КонецФункции

Функция СервисGET(Запрос)
	Возврат ОбработчикиHTTPЗапросов.СервисGET(Запрос);
КонецФункции

Функция СписокСервисовGET(Запрос)
	Возврат ОбработчикиHTTPЗапросов.СписокСервисовGET(Запрос);
КонецФункции
