
Функция СформироватьJsonSwagger() Экспорт 
	Описание = Новый Соответствие;
	Описание.Вставить("description", ЭтотОбъект._description);
	
	Если ЭтотОбъект.content.Количество() > 0 Тогда
		Описание.Вставить("content", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "content", "key", "mediaType"));
	КонецЕсли;
	Если ЭтотОбъект.headers.Количество() > 0 Тогда
		Описание.Вставить("headers", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "headers", "key", "header"));
	КонецЕсли;
	Если ЭтотОбъект.links.Количество() > 0 Тогда
		Описание.Вставить("links", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "links", "key", "link"));
	КонецЕсли;
	
	Возврат КоннекторHTTP.ОбъектВJson(Описание);
КонецФункции
